src/main/resources/loanPayload/loanBalanceRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.bottomline.com/webseries/schema/external/message/loan/v1" xmlns:v11="http://www.bottomline.com/webseries/schema/ps/message/common/v1" xmlns:v12="http://www.bottomline.com/webseries/schema/ps/platform/authentication/v1" xmlns:v13="http://www.bottomline.com/webseries/schema/ps/platform/common/v1" xmlns:v14="http://www.bottomline.com/webseries/schema/ps/platform/entitlements/v1" xmlns:v15="http://www.bottomline.com/webseries/schema/ps/platform/account/v1">
    <soapenv:Header/>
    <soapenv:Body>
        <v1:loanBalanceRequest>
            <v1:requestHeader>
                <v11:requestId>?</v11:requestId>
                <v11:requestUser>
                    <v12:userId>?</v12:userId>
                    <v12:data>
                        <v13:item>
                            <v13:name>?</v13:name>
                            <v13:value>?</v13:value>
                        </v13:item>
                    </v12:data>
                </v11:requestUser>
                <v11:channelId>?</v11:channelId>
                <v11:routingContext>?</v11:routingContext>
            </v1:requestHeader>
            <v1:balanceReference v14:provisioningAction="?">
                <v15:accountNumber>?</v15:accountNumber>
                <v15:bankCode>?</v15:bankCode>
                <v15:userGroupId>?</v15:userGroupId>
                <v15:accountName>?</v15:accountName>
                <v15:clientAccountName>?</v15:clientAccountName>
                <v15:currencyCode>?</v15:currencyCode>
                <v15:accountType>?</v15:accountType>
                <v15:accountState>?</v15:accountState>
                <v15:accountSubType>?</v15:accountSubType>
                <v15:bankName>?</v15:bankName>
                <v15:billingAccount>
                    <v13:accountNumber>?</v13:accountNumber>
                    <v13:bankCode>?</v13:bankCode>
                </v15:billingAccount>
                <v15:subAccountNumber>?</v15:subAccountNumber>
                <v15:tieredLoanType>?</v15:tieredLoanType>
                <v15:hostKey>?</v15:hostKey>
                <v15:hostPIN>?</v15:hostPIN>
                <v15:bankDefinedField1>?</v15:bankDefinedField1>
                <v15:bankDefinedField2>?</v15:bankDefinedField2>
                <v15:bankDefinedField3>?</v15:bankDefinedField3>
                <v15:bankDefinedField4>?</v15:bankDefinedField4>
                <v15:bankDefinedField5>?</v15:bankDefinedField5>
                <v15:bankDefinedField6>?</v15:bankDefinedField6>
                <v15:bankDefinedField7>?</v15:bankDefinedField7>
                <v15:bankDefinedField8>?</v15:bankDefinedField8>
                <v15:bankDefinedField9>?</v15:bankDefinedField9>
                <v15:bankDefinedField10>?</v15:bankDefinedField10>
                <v15:BIC>?</v15:BIC>
                <v15:ABA>?</v15:ABA>
                <v15:imageAccessSetting>?</v15:imageAccessSetting>
                <v15:settings>
                    <v13:name>?</v13:name>
                    <v13:value>?</v13:value>
                </v15:settings>
                <v15:productSettings>
                    <v13:productCode>?</v13:productCode>
                    <v13:settings>
                        <v13:name>?</v13:name>
                        <v13:value>?</v13:value>
                    </v13:settings>
                </v15:productSettings>
                <v13:address1>?</v13:address1>
                <v13:address2>?</v13:address2>
                <v13:address3>?</v13:address3>
                <v13:address4>?</v13:address4>
                <v13:city>?</v13:city>
                <v13:state>?</v13:state>
                <v13:province>?</v13:province>
                <v13:postalCode>?</v13:postalCode>
                <v13:countryCode>?</v13:countryCode>
                <v15:status>?</v15:status>
                <v15:tranType>?</v15:tranType>
                <v15:branchId>?</v15:branchId>
                <v15:tranCodeSet>?</v15:tranCodeSet>
                <v15:fundingMethod>?</v15:fundingMethod>
                <v15:imageAccount>?</v15:imageAccount>
                <v15:realTimeAccount>?</v15:realTimeAccount>
                <v15:realTimePostedTransactions>?</v15:realTimePostedTransactions>
                <v15:isConsumerAccount>?</v15:isConsumerAccount>
            </v1:balanceReference>
        </v1:loanBalanceRequest>
    </soapenv:Body>
</soapenv:Envelope>